#include <stdio.h>

int main() {
    // บรรทัดที่ 1: a = 0.617%
    printf("a=%6.3f%%\n", 0.617); // ใช้ %6.3f ให้มีทศนิยม 3 หลักและเว้นให้ตรงตำแหน่ง

    // บรรทัดที่ 2: b =    25%
    printf("b=%4d%%\n", 25); // %5d คือชิดขวาในช่อง 5 ตัวอักษร

    // บรรทัดที่ 3: c = 19.000%
    printf("c =%6.3f%%\n", 19.000); // %6.3f = ช่องกว้าง 6 แสดงทศนิยม 3 ตำแหน่ง

    // บรรทัดที่ 4: d =     9%
    printf("d  =%-2d%%\n", 9); // ช่องกว้าง 6 ตัวเลขอยู่ขวา

    // บรรทัดที่ 5: e = 124.555%
    printf("e=%7.3f%%\n", 124.555); // ช่องกว้าง 8 ตัวอักษร

    // บรรทัดที่ 6: f = 0.001%
    printf("f=%5.3f%%\n", 0.001); // ช่องกว้าง 6 แสดงทศนิยม 3 หลัก

    return 0;
}